source/_posts/2016-08-04-关于.html
---
title: "关于"
date: 2016-08-04
layout: post
categories: 
tags: 
published: true
comments: 
---


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">perl安装过程</h2>
<div class="outline-text-2" id="text-orgheadline3">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">Oracle Instant Client环境配置</h3>
<div class="outline-text-3" id="text-orgheadline1">
<p>
为了能够正常连接Oracle数据库，先配置Oracle Instant Clint，再安装Strawberry Perl
</p>

<p>
Oracle Instant Client官方下载地址：<a href="http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html">http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html</a>
</p>

<p>
百度网盘地址：<a href="http://yun.baidu.com/share/link?shareid=2601558786&amp;uk=372314040">http://yun.baidu.com/share/link?shareid=2601558786&amp;uk=372314040</a>
</p>

<p>
配置Oracle Instant Client需要以下三个包
</p>

<p>
instantclient-basic-zip
</p>

<p>
instantclient-sdk.zip
</p>

<p>
instantclient-sqlplus.zip
</p>

<p>
下载后解压到同一个文件夹,将该文件夹添加到Path环境变量，如PATH:F:\instantclient_12_1;
</p>

<p>
配置完环境变量后可以安装Strawberry Perl
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Strawberry Perl安装</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
Strawberry Perl官方下载地址：<a href="http://strawberryperl.com/">http://strawberryperl.com/</a>
</p>

<p>
百度网盘地址：<a href="http://pan.baidu.com/s/1slzl07b">http://pan.baidu.com/s/1slzl07b</a>
</p>

<p>
下载完成按正常流程安装即可。
</p>
</div>
</div>
</div>
